# Station Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabel..::..Station Property
AlignmentStationLabel Class See Also
---
The alignment station at which the SpotDimension is placed.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public double Station { get; set; }
```

Visual Basic
---
```text
Public Property Station As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Station {
	double get ();
	void set (double value);
}
```

# See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace